#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.ecs.data.aws_region.current: Reading...
module.ecs.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc.main: Reading...
module.vpc.data.aws_vpc.main: Read complete after 0s [id=vpc-0a2ad78d07019ee5e]
module.vpc.data.aws_internet_gateway.main: Reading...
module.vpc.data.aws_subnets.public: Reading...
module.vpc.data.aws_internet_gateway.main: Read complete after 0s [id=igw-050fe5abb72a49ac7]
module.vpc.data.aws_subnets.public: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudwatch.aws_cloudwatch_metric_alarm.course_service_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "course_service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when course service CPU utilization exceeds 80%"
      + alarm_name                            = "academiasync-prod-course-service-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "academiasync-prod-cluster"
          + "ServiceName" = "academiasync-prod-course-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name"    = "academiasync-prod-course-service-cpu-alarm"
          + "Service" = "course-service"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-course-service-cpu-alarm"
          + "Project"     = "academiasync"
          + "Service"     = "course-service"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.cloudwatch.aws_cloudwatch_metric_alarm.course_service_memory_high will be created
  + resource "aws_cloudwatch_metric_alarm" "course_service_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when course service memory utilization exceeds 80%"
      + alarm_name                            = "academiasync-prod-course-service-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "academiasync-prod-cluster"
          + "ServiceName" = "academiasync-prod-course-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name"    = "academiasync-prod-course-service-memory-alarm"
          + "Service" = "course-service"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-course-service-memory-alarm"
          + "Project"     = "academiasync"
          + "Service"     = "course-service"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.cloudwatch.aws_cloudwatch_metric_alarm.frontend_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "frontend_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when frontend CPU utilization exceeds 80%"
      + alarm_name                            = "academiasync-prod-frontend-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "academiasync-prod-cluster"
          + "ServiceName" = "academiasync-prod-frontend"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name"    = "academiasync-prod-frontend-cpu-alarm"
          + "Service" = "frontend"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-frontend-cpu-alarm"
          + "Project"     = "academiasync"
          + "Service"     = "frontend"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.cloudwatch.aws_cloudwatch_metric_alarm.frontend_memory_high will be created
  + resource "aws_cloudwatch_metric_alarm" "frontend_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when frontend memory utilization exceeds 80%"
      + alarm_name                            = "academiasync-prod-frontend-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "academiasync-prod-cluster"
          + "ServiceName" = "academiasync-prod-frontend"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name"    = "academiasync-prod-frontend-memory-alarm"
          + "Service" = "frontend"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-frontend-memory-alarm"
          + "Project"     = "academiasync"
          + "Service"     = "frontend"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.cloudwatch.aws_cloudwatch_metric_alarm.user_service_cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "user_service_cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when user service CPU utilization exceeds 80%"
      + alarm_name                            = "academiasync-prod-user-service-cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "academiasync-prod-cluster"
          + "ServiceName" = "academiasync-prod-user-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name"    = "academiasync-prod-user-service-cpu-alarm"
          + "Service" = "user-service"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-user-service-cpu-alarm"
          + "Project"     = "academiasync"
          + "Service"     = "user-service"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.cloudwatch.aws_cloudwatch_metric_alarm.user_service_memory_high will be created
  + resource "aws_cloudwatch_metric_alarm" "user_service_memory_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when user service memory utilization exceeds 80%"
      + alarm_name                            = "academiasync-prod-user-service-memory-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "academiasync-prod-cluster"
          + "ServiceName" = "academiasync-prod-user-service"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Name"    = "academiasync-prod-user-service-memory-alarm"
          + "Service" = "user-service"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-user-service-memory-alarm"
          + "Project"     = "academiasync"
          + "Service"     = "user-service"
        }
      + threshold                             = 80
      + treat_missing_data                    = "notBreaching"
    }

  # module.ecr.aws_ecr_lifecycle_policy.repos_policy["course-service"] will be created
  + resource "aws_ecr_lifecycle_policy" "repos_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "academiasync-prod-course-service"
    }

  # module.ecr.aws_ecr_lifecycle_policy.repos_policy["frontend"] will be created
  + resource "aws_ecr_lifecycle_policy" "repos_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "academiasync-prod-frontend"
    }

  # module.ecr.aws_ecr_lifecycle_policy.repos_policy["user-service"] will be created
  + resource "aws_ecr_lifecycle_policy" "repos_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "academiasync-prod-user-service"
    }

  # module.ecr.aws_ecr_repository.repos["course-service"] will be created
  + resource "aws_ecr_repository" "repos" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "academiasync-prod-course-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"    = "academiasync-prod-course-service"
          + "Service" = "course-service"
        }
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-course-service"
          + "Project"     = "academiasync"
          + "Service"     = "course-service"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.repos["frontend"] will be created
  + resource "aws_ecr_repository" "repos" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "academiasync-prod-frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"    = "academiasync-prod-frontend"
          + "Service" = "frontend"
        }
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-frontend"
          + "Project"     = "academiasync"
          + "Service"     = "frontend"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.repos["user-service"] will be created
  + resource "aws_ecr_repository" "repos" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "academiasync-prod-user-service"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name"    = "academiasync-prod-user-service"
          + "Service" = "user-service"
        }
      + tags_all             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-user-service"
          + "Project"     = "academiasync"
          + "Service"     = "user-service"
        }

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecs.aws_cloudwatch_log_group.course_service will be created
  + resource "aws_cloudwatch_log_group" "course_service" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/academiasync-prod/course-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name"    = "academiasync-prod-course-service-logs"
          + "Service" = "course-service"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-course-service-logs"
          + "Project"     = "academiasync"
          + "Service"     = "course-service"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.frontend will be created
  + resource "aws_cloudwatch_log_group" "frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/academiasync-prod/frontend"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name"    = "academiasync-prod-frontend-logs"
          + "Service" = "frontend"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-frontend-logs"
          + "Project"     = "academiasync"
          + "Service"     = "frontend"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.user_service will be created
  + resource "aws_cloudwatch_log_group" "user_service" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/academiasync-prod/user-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name"    = "academiasync-prod-user-service-logs"
          + "Service" = "user-service"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-user-service-logs"
          + "Project"     = "academiasync"
          + "Service"     = "user-service"
        }
    }

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "academiasync-prod-cluster"
      + tags     = {
          + "Name" = "academiasync-prod-cluster"
        }
      + tags_all = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-cluster"
          + "Project"     = "academiasync"
        }
    }

  # module.ecs.aws_ecs_service.course_service will be created
  + resource "aws_ecs_service" "course_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "academiasync-prod-course-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"    = "academiasync-prod-course-service"
          + "Service" = "course-service"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-course-service"
          + "Project"     = "academiasync"
          + "Service"     = "course-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-002c7d7adda9a9513",
              + "subnet-083e543b52c0545cf",
              + "subnet-09af81fdbb5715425",
              + "subnet-0a0800f6f2b791a1d",
              + "subnet-0c913f95f685e84d7",
              + "subnet-0d8a4bdd03b0d1bd4",
            ]
        }

      + service_registries {
          + container_name = "course-service"
          + registry_arn   = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.frontend will be created
  + resource "aws_ecs_service" "frontend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "academiasync-prod-frontend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"    = "academiasync-prod-frontend-service"
          + "Service" = "frontend"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-frontend-service"
          + "Project"     = "academiasync"
          + "Service"     = "frontend"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "frontend"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-002c7d7adda9a9513",
              + "subnet-083e543b52c0545cf",
              + "subnet-09af81fdbb5715425",
              + "subnet-0a0800f6f2b791a1d",
              + "subnet-0c913f95f685e84d7",
              + "subnet-0d8a4bdd03b0d1bd4",
            ]
        }
    }

  # module.ecs.aws_ecs_service.user_service will be created
  + resource "aws_ecs_service" "user_service" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "academiasync-prod-user-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name"    = "academiasync-prod-user-service"
          + "Service" = "user-service"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-user-service"
          + "Project"     = "academiasync"
          + "Service"     = "user-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-002c7d7adda9a9513",
              + "subnet-083e543b52c0545cf",
              + "subnet-09af81fdbb5715425",
              + "subnet-0a0800f6f2b791a1d",
              + "subnet-0c913f95f685e84d7",
              + "subnet-0d8a4bdd03b0d1bd4",
            ]
        }

      + service_registries {
          + container_name = "user-service"
          + registry_arn   = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.course_service will be created
  + resource "aws_ecs_task_definition" "course_service" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "academiasync-prod-course-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"    = "academiasync-prod-course-service-task"
          + "Service" = "course-service"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-course-service-task"
          + "Project"     = "academiasync"
          + "Service"     = "course-service"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_ecs_task_definition.frontend will be created
  + resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "academiasync-prod-frontend"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"    = "academiasync-prod-frontend-task"
          + "Service" = "frontend"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-frontend-task"
          + "Project"     = "academiasync"
          + "Service"     = "frontend"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_ecs_task_definition.user_service will be created
  + resource "aws_ecs_task_definition" "user_service" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "academiasync-prod-user-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name"    = "academiasync-prod-user-service-task"
          + "Service" = "user-service"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-user-service-task"
          + "Project"     = "academiasync"
          + "Service"     = "user-service"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "academiasync-prod-ecs-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "academiasync-prod-ecs-task"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-ecs-task"
          + "Project"     = "academiasync"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role.ecs_task_execution will be created
  + resource "aws_iam_role" "ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "academiasync-prod-ecs-task-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "academiasync-prod-ecs-task-execution"
        }
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-ecs-task-execution"
          + "Project"     = "academiasync"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role_policy_attachment.ecs_task_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "academiasync-prod-ecs-task-execution"
    }

  # module.ecs.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "academiasync-prod-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-002c7d7adda9a9513",
          + "subnet-083e543b52c0545cf",
          + "subnet-09af81fdbb5715425",
          + "subnet-0a0800f6f2b791a1d",
          + "subnet-0c913f95f685e84d7",
          + "subnet-0d8a4bdd03b0d1bd4",
        ]
      + tags                                                         = {
          + "Name" = "academiasync-prod-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-alb"
          + "Project"     = "academiasync"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.ecs.aws_lb_listener.frontend will be created
  + resource "aws_lb_listener" "frontend" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "academiasync"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.ecs.aws_lb_target_group.course_service will be created
  + resource "aws_lb_target_group" "course_service" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "academiasync-prod-course-svc-tg"
      + name_prefix                        = (known after apply)
      + port                               = 5001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "academiasync-prod-course-service-tg"
          + "Service" = "course-service"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-course-service-tg"
          + "Project"     = "academiasync"
          + "Service"     = "course-service"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0a2ad78d07019ee5e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.ecs.aws_lb_target_group.frontend will be created
  + resource "aws_lb_target_group" "frontend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "academiasync-prod-frontend-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "academiasync-prod-frontend-tg"
          + "Service" = "frontend"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-frontend-tg"
          + "Project"     = "academiasync"
          + "Service"     = "frontend"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0a2ad78d07019ee5e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 5
        }
    }

  # module.ecs.aws_lb_target_group.user_service will be created
  + resource "aws_lb_target_group" "user_service" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "academiasync-prod-user-svc-tg"
      + name_prefix                        = (known after apply)
      + port                               = 5000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"    = "academiasync-prod-user-service-tg"
          + "Service" = "user-service"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-user-service-tg"
          + "Project"     = "academiasync"
          + "Service"     = "user-service"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0a2ad78d07019ee5e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.ecs.aws_service_discovery_private_dns_namespace.main will be created
  + resource "aws_service_discovery_private_dns_namespace" "main" {
      + arn         = (known after apply)
      + description = "Private DNS namespace for academiasync services"
      + hosted_zone = (known after apply)
      + id          = (known after apply)
      + name        = "academiasync-prod.local"
      + tags        = {
          + "Name" = "academiasync-prod-namespace"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-namespace"
          + "Project"     = "academiasync"
        }
      + vpc         = "vpc-0a2ad78d07019ee5e"
    }

  # module.ecs.aws_service_discovery_service.course_service will be created
  + resource "aws_service_discovery_service" "course_service" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "course-service"
      + namespace_id  = (known after apply)
      + tags          = {
          + "Name"    = "academiasync-prod-course-service-discovery"
          + "Service" = "course-service"
        }
      + tags_all      = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-course-service-discovery"
          + "Project"     = "academiasync"
          + "Service"     = "course-service"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.ecs.aws_service_discovery_service.user_service will be created
  + resource "aws_service_discovery_service" "user_service" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "user-service"
      + namespace_id  = (known after apply)
      + tags          = {
          + "Name"    = "academiasync-prod-user-service-discovery"
          + "Service" = "user-service"
        }
      + tags_all      = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-user-service-discovery"
          + "Project"     = "academiasync"
          + "Service"     = "user-service"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = (known after apply)
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 10
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.sns.aws_sns_topic.cloudwatch_alarms will be created
  + resource "aws_sns_topic" "cloudwatch_alarms" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "academiasync-prod-cloudwatch-alarms"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Name" = "academiasync-prod-cloudwatch-alarms"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-cloudwatch-alarms"
          + "Project"     = "academiasync"
        }
      + tracing_config              = (known after apply)
    }

  # module.sns.aws_sns_topic_subscription.email will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (sensitive value)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.vpc.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "academiasync-prod-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "academiasync-prod-alb-sg"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-alb-sg"
          + "Project"     = "academiasync"
        }
      + vpc_id                 = "vpc-0a2ad78d07019ee5e"
    }

  # module.vpc.aws_security_group.ecs_tasks will be created
  + resource "aws_security_group" "ecs_tasks" {
      + arn                    = (known after apply)
      + description            = "Security group for ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "academiasync-prod-ecs-tasks-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "academiasync-prod-ecs-tasks-sg"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "academiasync-prod-ecs-tasks-sg"
          + "Project"     = "academiasync"
        }
      + vpc_id                 = "vpc-0a2ad78d07019ee5e"
    }

  # module.vpc.aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow traffic from ALB"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.vpc.aws_security_group_rule.ecs_self_reference will be created
  + resource "aws_security_group_rule" "ecs_self_reference" {
      + description              = "Allow ECS tasks to communicate with each other"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

Plan: 39 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudwatch_log_groups = {
      + course_service = "/ecs/academiasync-prod/course-service"
      + frontend       = "/ecs/academiasync-prod/frontend"
      + user_service   = "/ecs/academiasync-prod/user-service"
    }
  + course_service_name   = "academiasync-prod-course-service"
  + course_service_url    = (known after apply)
  + ecr_repository_urls   = {
      + academiasync-prod-course-service = (known after apply)
      + academiasync-prod-frontend       = (known after apply)
      + academiasync-prod-user-service   = (known after apply)
    }
  + ecs_cluster_arn       = (known after apply)
  + ecs_cluster_name      = "academiasync-prod-cluster"
  + frontend_service_name = "academiasync-prod-frontend"
  + frontend_url          = (known after apply)
  + public_subnet_ids     = [
      + "subnet-0a0800f6f2b791a1d",
      + "subnet-0c913f95f685e84d7",
      + "subnet-083e543b52c0545cf",
      + "subnet-0d8a4bdd03b0d1bd4",
      + "subnet-002c7d7adda9a9513",
      + "subnet-09af81fdbb5715425",
    ]
  + sns_topic_arn         = (known after apply)
  + user_service_name     = "academiasync-prod-user-service"
  + user_service_url      = (known after apply)
  + vpc_id                = "vpc-0a2ad78d07019ee5e"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @heyitsgautham, Action: `pull_request`*